export const BOOKS = [
  'Ծննդոց', 'Ելք', 'Ղևտական', 'Թվեր', 'Երկրորդ Օրինաց',
  'Հեսու', 'Դատավորներ', 'Հռութ', 'Ա Թագավորաց', 'Բ Թագավորաց',
  'Գ Թագավորաց', 'Դ Թագավորաց', 'Ա Մնացորդաց', 'Բ Մնացորդաց', 'Եզրաս',
  'Նեեմիա', 'Եսթեր', 'Հոբ', 'Սաղմոսներ', 'Առակներ',
  'Ժողովող', 'Երգ Երգոց', 'Եսայի', 'Երեմիա', 'Ողբ Երեմիայի',
  'Եզեկիել', 'Դանիել', 'Ովսեե', 'Հովել', 'Ամովս',
  'Աբդիա', 'Հովնան', 'Միքիա', 'Նաում', 'Ամբակում',
  'Սոփոնիա', 'Անգե', 'Զաքարիա', 'Մաղաքիա', 'Մատթեոս',
  'Մարկոս', 'Ղուկաս', 'Հովհաննես', 'Գործք', 'Հռոմեացիներ',
  'Ա Կորնթացիներ', 'Բ Կորնթացիներ', 'Գաղատացիներ', 'Եփեսացիներ', 'Փիլիպպեցիներ',
  'Կողոսացիներ', 'Ա Թեսաղոնիկեցիներ', 'Բ Թեսաղոնիկեցիներ', 'Ա Տիմոթեոս', 'Բ Տիմոթեոս',
  'Տիտոս', 'Փիլիմոն', 'Եբրայեցիներ', 'Հակոբոս', 'Ա Պետրոս',
  'Բ Պետրոս', 'Ա Հովհաննես', 'Բ Հովհաննես', 'Գ Հովհաննես', 'Հուդա',
  'Հայտնություն',
].map((name, index) => ({
  number: index + 1,
  name,
  testament: index < 39 ? 'Հին Կտակարան' : 'Նոր Կտակարան',
}));

export const DEFAULT_BOOK_NUMBER = 30;
export const BOOK_PATHS = (bookNumber) => [
  `/books/Book${bookNumber}.html`,
  `/Book${bookNumber}.html`,
];
